//
//  MainRepository.swift
//  TableMaster
//
//  Created by 박영호 on 2020/10/14.
//

import UIKit

class MainRepository {
    static let shared = MainRepository()
    let data =
        [
        "냉장고" : ["냉장고A", "냉장고B", "냉장고C", "냉장고D", "냉장고E"],
        "에어컨" : ["에어컨A", "에어컨B", "에어컨C"],
        "가스레인지" : ["가스레인지A", "가스레인지B", "가스레인지C", "가스레인지D"],
        "냉장고1" : ["냉장고A", "냉장고B", "냉장고C", "냉장고D", "냉장고E"],
        "에어컨1" : ["에어컨A", "에어컨B", "에어컨C"],
        "가스레인지1" : ["가스레인지A", "가스레인지B", "가스레인지C", "가스레인지D"],
        "냉장고2" : ["냉장고A", "냉장고B", "냉장고C", "냉장고D", "냉장고E"],
        "에어컨2" : ["에어컨A", "에어컨B", "에어컨C"],
        "가스레인지2" : ["가스레인지A", "가스레인지B", "가스레인지C", "가스레인지D"],
        "냉장고33" : ["냉장고A", "냉장고B", "냉장고C", "냉장고D", "냉장고E"],
        "에어컨33" : ["에어컨A", "에어컨B", "에어컨C"],
        "가스레인지44" : ["가스레인지A", "가스레인지B", "가스레인지C", "가스레인지D"],
        "냉장고121" : ["냉장고A", "냉장고B", "냉장고C", "냉장고D", "냉장고E"],
        "에어컨12" : ["에어컨A", "에어컨B", "에어컨C"],
        "가스레인지144" : ["가스레인지A", "가스레인지B", "가스레인지C", "가스레인지D"],
        "냉장고2131" : ["냉장고A", "냉장고B", "냉장고C", "냉장고D", "냉장고E"],
        "에어컨22" : ["에어컨A", "에어컨B", "에어컨C"],
        "가스레인지211" : ["가스레인지A", "가스레인지B", "가스레인지C", "가스레인지D"]
    ]
//    [
//        "A" : ["a"],
//        "B" : ["b", "bb"],
//        "C" : ["c", "cc", "ccc"],
//        "D" : ["d", "dd", "ddd", "dddd"],
//        "E" : ["e", "ee", "eee", "eeee", "eeeee"],
//        "F" : ["f", "ff", "fff", "ffff", "fffff", "ffffff"],
//        "G" : ["g", "gg", "ggg", "gggg", "ggggg", "gggggg", "ggggggg"]
//        ]
    
    //let data = [String() : [String]()]

    //let data = ["a": [String](), "b": ["zz","xx","cc"]]
}
